tap "homebrew/bundle"
brew "openssl@3"
brew "readline"
brew "aria2"
brew "cabextract"
brew "cdrtools"
brew "git"
brew "xz"
brew "gnupg"
brew "go"
brew "hashcat"
brew "hopenpgp-tools"
brew "john-jumbo"
brew "jupyterlab"
brew "mas"
brew "nmap"
brew "pinentry-mac"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "qemu"
brew "sphinx-doc"
brew "starship"
brew "stow"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "wget"
brew "wimlib"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "brave-browser"
cask "canva"
cask "font-fira-code-nerd-font"
cask "joplin"
cask "kitty"
cask "libreoffice"
cask "numi"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "wireshark"
cask "zettlr"
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
vscode "actboy168.lua-debug"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "davidanson.vscode-markdownlint"
vscode "deadrevolver.dark-space-theme"
vscode "dracula-theme.theme-dracula"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "executablebookproject.myst-highlight"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "idleberg.icon-fonts"
vscode "james-yu.latex-workshop"
vscode "jamesmaj.easy-icons"
vscode "jebbs.plantuml"
vscode "jeffersonqin.latex-snippets-jeff"
vscode "jep-a.lua-plus"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "oouo-diogo-perdigao.lua-in-xml"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sirilmp.dark-theme-sm"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomblind.local-lua-debugger-vscode"
vscode "trixnz.vscode-lua"
vscode "twxs.cmake"
vscode "tyriar.luna-paint"
vscode "xabikos.javascriptsnippets"
vscode "yinfei.luahelper"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
